export const MODES = ['КУБИК', 'ЗМЕЙКА', 'АРКАНОИД', 'ШУТЕР', 'ПТИЦА'];
export const COLORS = ['#a855f7', '#22c55e', '#3b82f6', '#f97316', '#ec4899'];

export const PALETTES = [
  ['#a855f7', '#22c55e', '#3b82f6', '#f97316', '#ec4899'], // Классика (Цикл 0)
  ['#06b6d4', '#f43f5e', '#fbbf24', '#8b5cf6', '#10b981'], // Киберпанк (Цикл 1)
  ['#facc15', '#a78bfa', '#fb7185', '#2dd4bf', '#818cf8'], // Пастельный неон (Цикл 2)
  ['#fb923c', '#4ade80', '#60a5fa', '#f472b6', '#c084fc'], // Рассвет (Цикл 3)
  ['#ffffff', '#ffffff', '#ffffff', '#ffffff', '#ffffff']  // Сингулярность (Цикл 4+)
];
